--- a/doc/analysis/md/pattern.md
+++ b/doc/analysis/md/pattern.md
@@ -39,36 +78,67 @@ classDiagram
+    2.  **API Simplification:** It provides a cleaner, more _scripting-friendly API_ (?) that abstracts away the complex internal workings of `NodeModel`.
 
 ### Structure Diagram
-```mermaid
-classDiagram
-    class ProxyNode {
-        <<interface>>
-        +getText() String
-        +setText(Object value)
+```plantuml
+    @startuml
+
+    package Freeplane {
+            interface ProxyNode {
+            + getText() : String
+            + setText(value: Object) : void
+        }
+
+        class NodeModel {
+            + getText() : String
+            + setText(text: String) : void
+        }
+
+
+
+        class NodeProxy {
+            - delegate : NodeModel
+            + getText() : String
+            + setText(value: Object) : void
+        }
     }
-    class NodeModel {
-        +getText() String
-        +setText(String text)
+
+
+    class GroovyScript <<Script user-defined, external>> {
+        +getText() : String
     }
-    class NodeProxy {
-        -NodeModel delegate
-        +getText() String
-        +setText(Object value)
-    }
+
     ProxyNode <|.. NodeProxy
     NodeProxy --> NodeModel : delegates to
+    GroovyScript --> ProxyNode : calls methods of >
+    @enduml
 ```
 
 *   **Alternative:** Expose `NodeModel` directly to the scripting engine.
     *   *Pros:* Less overhead and fewer classes.
